---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditDeletedWorkset
source: html/e75a309b-5761-8f97-2997-2cba8c91bf60.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditDeletedWorkset Property

This action has caused deletion of non-editable Workset ' [Name] '.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotEditDeletedWorkset { get; }
```